# 第五章 pandas入门

5.1 pandas 的数据结构介绍

In [4]:
import pandas as pd

In [5]:
from pandas import Series, DataFrame
import numpy as np

In [3]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4,7,-5,3],index=['d','a','c','b'])

In [9]:
obj2

d    4
a    7
c   -5
b    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'a', 'c', 'b'], dtype='object')

In [11]:
obj2['a']

7

In [12]:
obj2[['c', 'a', 'd']]

c   -5
a    7
d    4
dtype: int64

In [13]:
obj2[obj2 > 0]

d    4
a    7
b    3
dtype: int64

In [14]:
obj2 * 3

d    12
a    21
c   -15
b     9
dtype: int64

In [16]:
np.exp(obj2)

d      54.598150
a    1096.633158
c       0.006738
b      20.085537
dtype: float64

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,'Utah': 5000}
obj3 = Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata,index=states)

In [21]:
obj4  #NAN 在pandas中，它用于表示缺失或NA值

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
 obj3 + obj4  #索引相同 才会相加

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [33]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

DataFrame  (表格型的数据结构)

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [35]:
frame = pd.DataFrame(data)

In [36]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [38]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [39]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],index=['one', 'two', 'three', 'four','five', 'six'])

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [41]:
frame2.rank()

       year  state  pop  debt
one     1.0    5.0  1.0   NaN
two     2.5    5.0  2.0   NaN
three   4.5    5.0  6.0   NaN
four    2.5    2.0  3.0   NaN
five    4.5    2.0  4.0   NaN
six     6.0    2.0  5.0   NaN

In [44]:
frame2.columns()

TypeError: 'Index' object is not callable

In [49]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [50]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [51]:
frame2['debt'] = 16.5

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [53]:
frame2['debt'] = np.arange(6.)

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [55]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four','five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [56]:
frame2['debt'] = val

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [58]:
frame2['eastern'] = frame2.state == 'Ohio'

In [60]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [61]:
del frame2['eastern']

In [62]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [63]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

In [64]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [65]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [69]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [71]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [73]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [74]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [75]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

索引对象

In [76]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [77]:
index = obj.index

In [78]:
indx

NameError: name 'indx' is not defined

In [79]:
index

Index(['a', 'b', 'c'], dtype='object')

In [80]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [81]:
labels = pd.Index(np.arange(3))

In [82]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [83]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [84]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
obj2.index is labels

True

In [86]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [87]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

5.2基本功能

In [88]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a','c'])

In [89]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [90]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [91]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [92]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [93]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [94]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [96]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas','California'])

In [97]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [99]:
frame2 = frame.reindex(['a','b','c','d'])

In [100]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [101]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [102]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd','e'])

In [103]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [105]:
ne_obj = obj.drop('c')

In [106]:
ne_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [107]:
data =  pd.DataFrame(np.arange(16).reshape((4,4)),index=['O','C','U','N'],columns=['one','two','three','four'])

In [108]:
data

   one  two  three  four
O    0    1      2     3
C    4    5      6     7
U    8    9     10    11
N   12   13     14    15

In [109]:
data.drop('two')

KeyError: "['two'] not found in axis"

In [110]:
data.drop('two',axis=1)

   one  three  four
O    0      2     3
C    4      6     7
U    8     10    11
N   12     14    15

In [111]:
obj.drop('c',inplace=True)

In [112]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

索引、选取和过滤

In [113]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [114]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [116]:
obj['b']

1.0

In [117]:
obj[2]

2.0

In [119]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [120]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [122]:
 obj['b':'c']   #包含末端

b    1.0
c    2.0
dtype: float64

In [123]:
obj['b':'c'] = 5

In [124]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [125]:
data

   one  two  three  four
O    0    1      2     3
C    4    5      6     7
U    8    9     10    11
N   12   13     14    15

In [126]:
data['two']

O     1
C     5
U     9
N    13
Name: two, dtype: int32

In [129]:
data[['three','one']]

   three  one
O      2    0
C      6    4
U     10    8
N     14   12

In [130]:
data[:2]

   one  two  three  four
O    0    1      2     3
C    4    5      6     7

In [131]:
data[data['three'] > 5]

   one  two  three  four
C    4    5      6     7
U    8    9     10    11
N   12   13     14    15

In [132]:
data < 5

     one    two  three   four
O   True   True   True   True
C   True  False  False  False
U  False  False  False  False
N  False  False  False  False

In [133]:
data[data<5] = 0

In [134]:
data

   one  two  three  four
O    0    0      0     0
C    0    5      6     7
U    8    9     10    11
N   12   13     14    15

In [135]:
data

   one  two  three  four
O    0    0      0     0
C    0    5      6     7
U    8    9     10    11
N   12   13     14    15

In [136]:
data.loc['C',['two','three']]

two      5
three    6
Name: C, dtype: int32

In [137]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: U, dtype: int32

In [138]:
data.loc[:'U','two']

O    0
C    5
U    9
Name: two, dtype: int32

In [140]:
ser = pd.Series(np.arange(3))

In [141]:
ser

0    0
1    1
2    2
dtype: int32

In [143]:
ser[:1]

0    0
dtype: int32

In [144]:
ser.loc[:1]

0    0
1    1
dtype: int32

In [145]:
ser.iloc[:1]

0    0
dtype: int32

算术运算和数据对齐

In [146]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd','e'])

In [147]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [148]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [149]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [150]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [152]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [153]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas','Oregon'])

In [154]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [155]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [156]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [157]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

   A
0  1
1  2

In [158]:
df2

   B
0  3
1  4

In [159]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

在算术方法中填充值

In [160]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [161]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [162]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [163]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [164]:
df2.loc[1, 'b'] = np.nan

In [165]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [166]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [167]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [168]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

DataFrame和Series之间的运算

In [169]:
arr = np.arange(12.).reshape((3, 4))

In [170]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [171]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [172]:
frame  = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas','Oregon'])

In [173]:
series = frame.iloc[0]

In [174]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [176]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

函数应用和映射

In [182]:
frame = pd.DataFrame(np.random.randn(4, 3),columns=list('bde'),index=['Utah', 'Ohio', 'Texas','Oregon'])

In [183]:
frame

               b         d         e
Utah    1.154253  0.097232  0.199733
Ohio   -0.384677 -0.258679  1.234073
Texas   0.068850  1.719089  1.017081
Oregon -2.268754  1.264285 -0.321572

In [184]:
np.abs(frame)

               b         d         e
Utah    1.154253  0.097232  0.199733
Ohio    0.384677  0.258679  1.234073
Texas   0.068850  1.719089  1.017081
Oregon  2.268754  1.264285  0.321572

In [185]:
f = lambda x: x.max() - x.min()

In [186]:
frame.apply(f)

b    3.423007
d    1.977768
e    1.555645
dtype: float64

In [187]:
frame.apply(f,axis='columns')

Utah      1.057021
Ohio      1.618750
Texas     1.650239
Oregon    3.533039
dtype: float64

5.3 汇总和计算描述统计

In [188]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [189]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [190]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [191]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [192]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [193]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [194]:
df.idxmax()

one    b
two    d
dtype: object

In [195]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [196]:
df.min()

one    0.75
two   -4.50
dtype: float64

相关系数与协方差

In [1]:
import pandas_datareader.data as web

In [2]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [10]:
price = pd.DataFrame({ticker: data['Adj Close']for ticker, data in all_data.items()})
price

                  AAPL         IBM        MSFT         GOOG
Date
2009-12-31   20.073631   99.303009   24.241983   307.986847
2010-01-04   20.386072  100.478867   24.615801   311.349976
2010-01-05   20.421322   99.265091   24.623755   309.978882
2010-01-06   20.096491   98.620255   24.472631   302.164703
2010-01-07   20.059338   98.278870   24.218124   295.130463
2010-01-08   20.192701   99.265091   24.385145   299.064880
2010-01-11   20.014568   98.225777   24.074966   298.612823
2010-01-12   19.786903   99.007156   23.915895   293.332153
2010-01-13   20.066006   98.794746   24.138592   291.648102
2010-01-14   19.949797  100.372673   24.623755   293.019196
2010-01-15   19.616390   99.970589   24.544212   288.126007
2010-01-19   20.484186  101.760918   24.735104   291.911407
2010-01-20   20.168890   98.809929   24.329473   288.329681
2010-01-21   19.820242   97.861649   23.868181   289.606384
2010-01-22   18.837185   95.206505   23.033073   273.227905
2010-01-25   19.343958   95.676834   23.319397   268.255249
2010-01-26   19.617346   95.396156   23.462553   269.457428
2010-01-27   19.802147   95.836143   23.597769   269.298462
2010-01-28   18.983883   93.878906   23.192135   265.418701
2010-01-29   18.295170   92.847176   22.412704   263.257751
2010-02-01   18.549507   94.576828   22.595629   264.787811
2010-02-02   18.657150   95.229240   22.635405   263.843964
2010-02-03   18.978167   95.327866   22.770605   268.662598
2010-02-04   18.294220   93.309929   22.142290   261.687958
2010-02-05   18.619045   93.704422   22.285454   263.928406
2010-02-08   18.491404   92.873825   22.046848   265.011353
2010-02-09   18.688580   93.887291   22.277498   266.486755
2010-02-10   18.586657   93.582497   22.261591   265.498199
2010-02-11   18.924822   94.283569   22.364988   266.466888
2010-02-12   19.087709   94.489265   22.213871   264.837494
...                ...         ...         ...          ...
2019-01-17  155.194397  120.782738  105.668724  1089.900024
2019-01-18  156.150314  122.393959  107.251953  1098.260010
2019-01-22  152.645340  121.108925  105.230591  1070.520020
2019-01-23  153.262680  131.359497  106.256210  1075.569946
2019-01-24  152.047897  131.003647  105.748375  1073.900024
2019-01-25  157.086288  132.427063  106.714249  1090.989990
2019-01-28  155.632523  132.723618  104.633141  1070.079956
2019-01-29  154.019440  132.782913  102.502243  1060.619995
2019-01-30  164.544296  132.832336  105.927612  1089.060059
2019-01-31  165.729218  132.871872  103.985909  1116.369995
2019-02-01  165.808884  132.555573  102.342918  1110.750000
2019-02-04  170.518677  133.633011  105.290337  1132.800049
2019-02-05  173.436157  133.988861  106.764046  1145.989990
2019-02-06  173.495911  134.750000  105.579102  1115.229980
2019-02-07  170.210007  133.190002  104.822327  1098.709961
2019-02-08  170.410004  133.710007  105.220634  1095.060059
2019-02-11  169.429993  133.990005  104.802422  1095.010010
2019-02-12  170.889999  136.050003  106.435448  1121.369995
2019-02-13  170.179993  137.520004  106.355782  1120.160034
2019-02-14  170.800003  136.479996  106.445404  1121.670044
2019-02-15  170.419998  138.029999  107.759789  1113.650024
2019-02-19  170.929993  138.699997  107.709999  1118.560059
2019-02-20  172.029999  138.000000  107.150002  1113.800049
2019-02-21  171.059998  137.839996  109.410004  1096.969971
2019-02-22  172.970001  139.250000  110.970001  1110.369995
2019-02-25  174.229996  139.460007  111.589996  1109.400024
2019-02-26  174.330002  139.720001  112.360001  1115.130005
2019-02-27  174.869995  139.169998  112.169998  1116.050049
2019-02-28  173.149994  138.130005  112.029999  1119.920044
2019-03-01  174.970001  139.199997  112.529999  1140.989990

[2306 rows x 4 columns]

In [11]:
volume = pd.DataFrame({ticker: data['Volume']for ticker, data in all_data.items()})
volume

                   AAPL         IBM         MSFT        GOOG
Date
2009-12-31   88102700.0   4223400.0   31929700.0   2455400.0
2010-01-04  123432400.0   6155300.0   38409100.0   3937800.0
2010-01-05  150476200.0   6841400.0   49749600.0   6048500.0
2010-01-06  138040000.0   5605300.0   58182400.0   8009000.0
2010-01-07  119282800.0   5840600.0   50559700.0  12912000.0
2010-01-08  111902700.0   4197200.0   51197400.0   9509900.0
2010-01-11  115557400.0   5730400.0   68754700.0  14519600.0
2010-01-12  148614900.0   8081500.0   65912100.0   9769600.0
2010-01-13  151473000.0   6455400.0   51863500.0  13077600.0
2010-01-14  108223500.0   7111800.0   63228100.0   8535300.0
2010-01-15  148516900.0   8494400.0   79913200.0  10939600.0
2010-01-19  182501900.0  13916200.0   46575700.0   8689500.0
2010-01-20  153038200.0  15197500.0   54849500.0   6543600.0
2010-01-21  152038600.0   9608600.0   73086700.0  12697400.0
2010-01-22  220441900.0  10088600.0  102004600.0  13689200.0
2010-01-25  266424900.0   5738500.0   63373000.0   8897200.0
2010-01-26  466777500.0   7135300.0   66639900.0   8767600.0
2010-01-27  430642100.0   8719200.0   63949500.0   7980200.0
2010-01-28  293375600.0   9622200.0  117513700.0   6500100.0
2010-01-29  311488100.0  11571200.0  193888500.0   8334700.0
2010-02-01  187469100.0   7242900.0   85931100.0   4530800.0
2010-02-02  174585600.0   5899900.0   54413700.0   8245600.0
2010-02-03  153832000.0   4177100.0   61397900.0   6037000.0
2010-02-04  189413000.0   9126900.0   77850000.0   6799200.0
2010-02-05  212576700.0   8617000.0   80960100.0   6353000.0
2010-02-08  119567700.0   5718500.0   52820600.0   5423500.0
2010-02-09  158221700.0   6044500.0   59195800.0   5675700.0
2010-02-10   92590400.0   5219100.0   48591300.0   5383700.0
2010-02-11  137586400.0   5089000.0   65993700.0   4851300.0
2010-02-12  163867200.0   8017700.0   81117200.0   4589000.0
...                 ...         ...          ...         ...
2019-01-17   29821200.0   5029900.0   28393000.0   1242700.0
2019-01-18   33751000.0   6008500.0   37427600.0   1955600.0
2019-01-22   30394000.0  10052400.0   32371300.0   1613500.0
2019-01-23   23130600.0  22063700.0   25874300.0    967000.0
2019-01-24   25441500.0   6322900.0   23164800.0   1361300.0
2019-01-25   33535500.0   5707400.0   31225600.0   1119100.0
2019-01-28   26192100.0   5357700.0   29476700.0   1284300.0
2019-01-29   41587200.0   5037100.0   31490500.0   1021800.0
2019-01-30   61109800.0   4500900.0   49471900.0   1279800.0
2019-01-31   40739600.0   4884000.0   55636400.0   1538300.0
2019-02-01   32668100.0   3806000.0   35535700.0   1462200.0
2019-02-04   31495500.0   3966600.0   31315100.0   2576500.0
2019-02-05   36101600.0   5398900.0   27325400.0   3552200.0
2019-02-06   28239600.0   4879700.0   20609800.0   2105600.0
2019-02-07   31741700.0   4379400.0   29760700.0   2044800.0
2019-02-08   23820000.0   3249800.0   21461100.0   1075800.0
2019-02-11   20993400.0   3095100.0   18914100.0   1065200.0
2019-02-12   22283500.0   3317200.0   25056600.0   1609100.0
2019-02-13   22490200.0   4253000.0   18394900.0   1049800.0
2019-02-14   21835700.0   2789400.0   21784700.0    947600.0
2019-02-15   24626800.0   3844100.0   26606900.0   1449800.0
2019-02-19   18972800.0   3385700.0   18038500.0   1046400.0
2019-02-20   26114400.0   3802000.0   21607700.0   1087800.0
2019-02-21   17249700.0   2937300.0   29063200.0   1415100.0
2019-02-22   18913200.0   3113700.0   27763200.0   1049500.0
2019-02-25   21873400.0   3194200.0   23750600.0   1413100.0
2019-02-26   17070200.0   3060400.0   21536700.0   1471300.0
2019-02-27   27835400.0   2530900.0   21487100.0    968400.0
2019-02-28   28215400.0   3457800.0   29083900.0   1542500.0
2019-03-01   25873500.0   2979600.0   20827800.0   1449800.0

[2306 rows x 4 columns]

In [15]:
returns = price.pct_change()
returns

                AAPL       IBM      MSFT      GOOG
Date
2009-12-31       NaN       NaN       NaN       NaN
2010-01-04  0.015565  0.011841  0.015420  0.010920
2010-01-05  0.001729 -0.012080  0.000323 -0.004404
2010-01-06 -0.015906 -0.006496 -0.006137 -0.025209
2010-01-07 -0.001849 -0.003462 -0.010400 -0.023279
2010-01-08  0.006648  0.010035  0.006897  0.013331
2010-01-11 -0.008822 -0.010470 -0.012720 -0.001512
2010-01-12 -0.011375  0.007955 -0.006607 -0.017684
2010-01-13  0.014105 -0.002145  0.009312 -0.005741
2010-01-14 -0.005791  0.015972  0.020099  0.004701
2010-01-15 -0.016712 -0.004006 -0.003230 -0.016699
2010-01-19  0.044238  0.017909  0.007777  0.013138
2010-01-20 -0.015392 -0.028999 -0.016399 -0.012270
2010-01-21 -0.017286 -0.009597 -0.018960  0.004428
2010-01-22 -0.049599 -0.027132 -0.034988 -0.056554
2010-01-25  0.026903  0.004940  0.012431 -0.018200
2010-01-26  0.014133 -0.002934  0.006139  0.004481
2010-01-27  0.009420  0.004612  0.005763 -0.000590
2010-01-28 -0.041322 -0.020423 -0.017190 -0.014407
2010-01-29 -0.036279 -0.010990 -0.033608 -0.008142
2010-02-01  0.013902  0.018629  0.008162  0.005812
2010-02-02  0.005803  0.006898  0.001760 -0.003565
2010-02-03  0.017206  0.001036  0.005973  0.018263
2010-02-04 -0.036039 -0.021168 -0.027593 -0.025961
2010-02-05  0.017756  0.004228  0.006466  0.008562
2010-02-08 -0.006855 -0.008864 -0.010707  0.004103
2010-02-09  0.010663  0.010912  0.010462  0.005567
2010-02-10 -0.005454 -0.003246 -0.000714 -0.003710
2010-02-11  0.018194  0.007491  0.004645  0.003649
2010-02-12  0.008607  0.002182 -0.006757 -0.006115
...              ...       ...       ...       ...
2019-01-17  0.005938  0.004687  0.007022  0.008261
2019-01-18  0.006159  0.013340  0.014983  0.007670
2019-01-22 -0.022446 -0.010499 -0.018847 -0.025258
2019-01-23  0.004044  0.084639  0.009746  0.004717
2019-01-24 -0.007926 -0.002709 -0.004779 -0.001553
2019-01-25  0.033137  0.010865  0.009134  0.015914
2019-01-28 -0.009255  0.002239 -0.019502 -0.019166
2019-01-29 -0.010365  0.000447 -0.020365 -0.008840
2019-01-30  0.068335  0.000372  0.033418  0.026815
2019-01-31  0.007201  0.000298 -0.018330  0.025077
2019-02-01  0.000481 -0.002380 -0.015800 -0.005034
2019-02-04  0.028405  0.008128  0.028799  0.019851
2019-02-05  0.017109  0.002663  0.013997  0.011644
2019-02-06  0.000345  0.005681 -0.011099 -0.026841
2019-02-07 -0.018939 -0.011577 -0.007168 -0.014813
2019-02-08  0.001175  0.003904  0.003800 -0.003322
2019-02-11 -0.005751  0.002094 -0.003975 -0.000046
2019-02-12  0.008617  0.015374  0.015582  0.024073
2019-02-13 -0.004155  0.010805 -0.000748 -0.001079
2019-02-14  0.003643 -0.007563  0.000843  0.001348
2019-02-15 -0.002225  0.011357  0.012348 -0.007150
2019-02-19  0.002993  0.004854 -0.000462  0.004409
2019-02-20  0.006435 -0.005047 -0.005199 -0.004255
2019-02-21 -0.005639 -0.001159  0.021092 -0.015111
2019-02-22  0.011166  0.010229  0.014258  0.012215
2019-02-25  0.007284  0.001508  0.005587 -0.000874
2019-02-26  0.000574  0.001864  0.006900  0.005165
2019-02-27  0.003098 -0.003936 -0.001691  0.000825
2019-02-28 -0.009836 -0.007473 -0.001248  0.003468
2019-03-01  0.010511  0.007746  0.004463  0.018814

[2306 rows x 4 columns]

In [9]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-02-25  0.007284  0.001508  0.005587 -0.000874
2019-02-26  0.000574  0.001864  0.006900  0.005165
2019-02-27  0.003098 -0.003936 -0.001691  0.000825
2019-02-28 -0.009836 -0.007473 -0.001248  0.003468
2019-03-01  0.010511  0.007746  0.004463  0.018814

In [12]:
returns['MSFT'].corr(returns['IBM'])

0.4866831097879074

In [13]:
returns['MSFT'].cov(returns['IBM'])

8.734718905795014e-05

In [14]:
returns.MSFT.corr(returns.IBM)

0.4866831097879074

In [16]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.372080  0.450247  0.457481
IBM   0.372080  1.000000  0.486683  0.408324
MSFT  0.450247  0.486683  1.000000  0.537512
GOOG  0.457481  0.408324  0.537512  1.000000

唯一值、值计数以及成员资格

In [17]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c','c'])

In [18]:
uniques = obj.unique()

In [19]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [20]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [21]:
pd.value_counts(obj.values, sort=False)

d    1
c    3
b    2
a    3
dtype: int64

In [22]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [23]:
mask = obj.isin(['b', 'c'])

In [24]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool